{"faculty":
[
  {
  "category":"Faculty",
  "userName":"abramson",
  "middleName":"",
  "degree":"Ed.D.",
  "firstName":"Gertrude",
  "lastName":"Abramson",
  "title":"Professor",
  "bio":"Dr. Abramson is the author of numerous journal articles and conference presentations focusing on educational technology; she is the Executive Editor of the Journal of Applied Learning Technology. Her expertise has led her to become a keynote speaker nationally and internationally, most notably at Tel Aviv University in Israel and at Interactive Technologies in Washington DC. Dr. Abramson earned her Ed.D. at Columbia University in Communications, Computing, and Technology in Education. Her research interests include online teaching, learning and communications, online program development and administration, technology across the curriculum, applied assistive technology, information literacy, and adult education."
  },
  {
  "category":"Faculty",
  "userName":"mitrof",
  "middleName":"J",
  "degree":"Ph.D.",
  "firstName":"Frank",
  "lastName":"Mitropoulos",
  "title":"Professor",
  "bio":"Since joining the school’s faculty in 1994, Dr. Mitropoulos has also served as its Director of Computing. He is a member of IEEE, UPE and ACM. Dr. Mitropoulos completed his doctorate at NSU, where his dissertation research focused on software engineering. His research interests include software engineering, programming languages, compiler theory, object-oriented software development, and aspect-oriented software development."
  },
  {
  "category":"Faculty",
  "userName":"terrell",
  "middleName":"R",
  "degree":"Ph.D.",
  "firstName":"Steven",
  "lastName":"Terrell",
  "title":"Professor",
  "bio":"Dr. Terrell has been with the Graduate School of Computer and Information Sciences since 1988 and teaches quantitative methods and qualitative research to students in the technology in education and information systems doctoral programs. His background includes master’s degrees in business and counseling psychology and a doctorate from Florida International University focusing on educational research and statistics. Dr. Terrell is the author of over 100 conference presentations, book chapters and journal articles primarily focusing on student motivation and the use of technology in the classroom. His current research interests include the investigation of attrition from distance-based graduate programs. He serves as the statistical editor for The Internet in Higher Education, as well as on the editorial boards of several other national and international journals and recently completed a three-year role as President of the Online Teaching and Learning Special Interest Group of the American Educational Research Association."
  },
  {
  "category":"Faculty",
  "userName":"jps",
  "middleName":"",
  "degree":"Ph.D.",
  "firstName":"Junping",
  "lastName":"Sun",
  "title":"Professor",
  "bio":"Dr. Sun joined NSU in 1992 after earning his Ph.D. from Wayne State University. His research interests include database management systems, data warehousing and OLAP, knowledge discovery in database systems, parallel database processing, probabilistic and fuzzy databases, semantic query optimization, intelligent database interfaces, object-oriented database systems, and bioinformatics. Dr. Sun is the author of numerous conference presentations and journal articles, as well as serving as an associate editor of The Journal of Engineering Letters (International Association of Engineers), International Journal of Advanced Intelligence, and for The International Journal of Computers and Their Applications. He is a member of the Association for Computing Machinery (ACM) and senior member of the Institute of Electrical and Electronics Engineers."
  },
  {
  "category":"Faculty",
  "userName":"cohenm",
  "middleName":"S",
  "degree":"Ph.D.",
  "firstName":"Maxine",
  "lastName":"Cohen",
  "title":"Professor",
  "bio":"Since 1996, Dr. Cohen has taught and researched human-computer interaction (HCI). Prior to NSU, she worked for IBM in New York and Florida on HCI initiatives. She earned her Ph.D at the State University of New York at Binghamton, where she subsequently developed Binghamton’s first HCI courses. In recent years, Dr. Cohen has reviewed proposals for NSF graduate student fellowships. She participated in the 2008 Women's Institute in Summer Enrichment, an NSF-funded program. Also in 2008, Dr. Cohen collaborated with Ben Shneiderman and Catherine Plaisant on the fifth edition of Designing the User Interface, one of the standard textbooks in the HCI field."
  },
  {
  "category":"Faculty",
  "userName":"greg",
  "middleName":"E",
  "degree":"Ph.D.",
  "firstName":"Greg",
  "lastName":"Simco",
  "title":"Professor",
  "bio":"Prior to joining NSU, Dr. Simco was the Technical and Team leader for OS/2 and Workplace OS kernel and file systems for IBM and Senior Research and Development Engineer and Director of Systems Software for the Panda Project. Dr. Simco is the author of various conference presentations and journal articles primarily focusing on the architecture, design, performance, and evaluation of survivable/dependable distributed systems. He is involved in NSU's Florida Lambda Rail project and the Secure and Robust Distributed Systems initiative within Center of Excellence in Information Assurance at NSU. Dr. Simco teaches masters and doctoral courses in operating systems, mobile computing, distributed systems, and networks and data communication. He received his Bachelor of Science in Engineering (Computer and Information Science) from the University of Florida, and a Master of Science and Ph.D. in Computer Science from NSU."
  },
  {
  "category":"Faculty",
  "userName":"smithmt",
  "middleName":"M",
  "degree":"Ph.D.",
  "firstName":"Marti",
  "lastName":"Snyder",
  "title":"Associate Professor",
  "bio":"Prior to joining GSCIS in 2006, Dr. Snyder spent over 15 years in business and industry primarily as an instructional designer and performance improvement and organizational development consultant. She has a master's degree in educational technology from the University of Missouri-Columbia and a doctorate from NSU in computing technology in education. Her research interests include instructional design theory and model building and validation, communities of practice, and workplace learning. She is a member of the American Educational Research Association, International Society for Performance Improvement and the Association for Educational Communications and Technology and serves as a reviewer for various journals in technology and higher education."
  },
  {
  "category":"Faculty",
  "userName":"tommac",
  "middleName":"",
  "degree":"Ed.D.",
  "firstName":"Tom",
  "lastName":"MacFarland",
  "title":"Associate Professor",
  "bio":"Dr. MacFarland joined the Graduate School of Computer and Information Sciences in 1988 and has been on administrative leave since 1994 in the University’s Office of Institutional Research. In this capacity, he provides consulting services to the University community on research methods and statistical design as well as individual research on institutional concerns and assessment of student learning."
  },
  {
  "category":"Faculty",
  "userName":"laurie",
  "middleName":"",
  "degree":"Ph.D.",
  "firstName":"Laurie",
  "lastName":"Dringus",
  "title":"Professor",
  "bio":"Dr. Dringus earned her undergraduate and master’s degrees in psychology, and her Ph.D. in information systems, from NSU. Dr. Dringus has taught over 150 graduate level courses online and has been involved in distance learning and online learning since 1983. She was part of the pioneering group at NSU in online learning that started in 1983. She also served as director of one of the first online master’s programs at NSU established in the mid-80s. As a full-time faculty member since 1991, her research and teaching interests continue to focus on user-centered design and information systems, delivery and support of online learning environments, and computer-mediated technology and interactivity. Dr. Dringus is a member of several professional associations and presents at several associated conferences, including those sponsored by Sloan-C, AERA, ACM, and IEEE. She has authored approximately 65+ articles and presentations in the area of human-computer interaction and online learning environments. Currently, her research relates to studying the effects of temporal transitions on participation flow in asynchronous discussion forums. She is also conducting research on the effective use of audio to enhance teacher presence in online discussions. Her future creative endeavors include developing new graduate courses and continuing her research in social networking, computer-mediated communication, and communities of practice. Since 1998, Dr. Dringus has served as Editor-in-Chief of The Internet and Higher Education, a refereed international journal published quarterly by Elsevier."
  },
  {
  "category":"Faculty",
  "userName":"cannady",
  "middleName":"D",
  "degree":"Ph.D.",
  "firstName":"James",
  "lastName":"Cannady",
  "title":"Professor",
  "bio":"In addition to teaching graduate-level courses in information security and assurance, Dr.Cannady has worked extensively with Federal, State, and local governments to improve the security of their critical information systems. Dr. Cannady’s research efforts concern the intersection between artificial intelligence and information security. In particular, he is working to develop new adaptive intelligent systems that can be applied to protect computer systems and networks. These techniques include the use of complex adaptive systems and advanced neural networks in the detection of network-based attacks. Dr. Cannady’s Ph.D. research, at NSU, is in this area. Prior to his academic career, Dr. Cannady was a Special Agent with the U.S. Naval Investigative Service, specializing in counterintelligence matters and the protection of military computer and communication systems."
  },
  {
  "category":"Faculty",
  "userName":"lpei",
  "middleName":"",
  "degree":"Ph.D.",
  "firstName":"Peixiang",
  "lastName":"Liu",
  "title":"Associate Professor",
  "bio":"Dr Liu obtained his Ph.D. in 2007 from Imperial College London. He received his M.S. degree in computer science from Peking University in 2001 and obtained his second M.S. in computer science from University of Central Florida in 2004. His research interests include computer networks, routing protocol, QoS routing, database systems, genetic algorithms, machine learning and performance evaluation."
  },
  {
  "category":"Faculty",
  "userName":"jlparrish",
  "middleName":"",
  "degree":"Ph.D.",
  "firstName":"James",
  "lastName":"Parrish",
  "title":"Assistant Professor",
  "bio":"Dr. Parrish earned his Ph.D. in Information Systems from the University of Central Florida in 2008. Before joining the faculty at NSU, he was an assistant professor at University of Arkansas at Little Rock (UALR) where hewas actively involved in student instruction, course development, and in the creation of partnerships between industry and academia. These activities were major reasons that he was chosen be a part of the faculty for the Executive MBA (EMBA) program in the College of Business and for the Technology Innovation program in the College of Engineering and InformationTechnology. Dr. Parrish is an active researcher whose academic interests include knowledge management systems, social engineering, decision support systems, and IT strategy. Prior to entering academia, he had over 10 years experience working in the information systems field for public and private sector organizations as a web designer and programmer, systems analyst, IT manager, and consultant."
  },
  {
  "category":"Faculty",
  "userName":"lingwang",
  "middleName":"",
  "degree":"Ph.D.",
  "firstName":"Ling",
  "lastName":"Wang",
  "title":"Professor",
  "bio":"Dr. Wang joined NSU in 2003, after earning her Ph.D. in educational technology from Purdue University. She teaches graduate courses in Computing Technology in Education and Information Systems, conducts research projects and studies, advises doctoral students’ dissertations, and serves as reviewer for many national and international journals. Her research areas include: educational technology integration, educational applications of Web 2.0 technologies, faculty professional development, and Community of Practice in graduate programs."
  },
  {
  "category":"Faculty",
  "userName":"sumitra",
  "middleName":"",
  "degree":"Ph.D.",
  "firstName":"Sumitra",
  "lastName":"Mukherjee",
  "title":"Professor",
  "bio":"Dr. Mukherjee received his Ph.D. in Decision and Information Systems from Carnegie Mellon University. Prior to joining GSCIS in 1996, Dr. Mukherjee was a faculty member in the department of Computer Information Systems at Baruch College, University of New York. His research interests are in data security, machine intelligence, and automated support for organizational decision making. His publications have appeared in Journals such as Management Science, Journal of the American Statistical Association, IEEE Transactions on Pattern Analysis and Machine Intelligence, IEEE Transactions on Knowledge and Data Engineering, Discrete Applied Mathematics, Operations Research Letters, Optimization Letters, and Pattern Recognition Letters."
  },
  {
  "category":"Faculty",
  "userName":"mjl",
  "middleName":"",
  "degree":"Ph.D.",
  "firstName":"Michael",
  "lastName":"Laszlo",
  "title":"Professor",
  "bio":"Dr. Laszlo holds a doctoral and master’s degree in computer science from Princeton University and a bachelor’s degree in mathematics from Vassar College. He is the author of three books, Object-Oriented Programming featuring Graphical Applications in Java, The Schemer's Guide to Solid Modeling, and Computational Geometry and Computer Graphics in C++. Dr. Laszlo’s research interests include computer graphics, data structures and algorithms, software engineering, and programming languages."
  },
  {
  "category":"Faculty",
  "userName":"ellist",
  "middleName":"",
  "degree":"Ph.D.",
  "firstName":"Timothy",
  "lastName":"Ellis",
  "title":"Professor",
  "bio":"Dr. Timothy Ellis obtained a B.S. degree in History from Bradley University, an M.A. in Rehabilitation Counseling from Southern Illinois University, a C.A.G.S. in Rehabilitation Administration from Northeastern University, and a Ph.D. in Computing Technology Education from Nova Southeastern University. He joined NSU as Assistant Professor in 1999 and currently teaches computer technology courses at both the Masters and Ph.D. level in the Graduate School of Computer and Informatoin Sciences. Prior to joining NSU, he was on the faculty at Fisher College as chair of the Computer Technology department. His research interests include: multimedia, knowledge management, distance education, and adult learning. He has published in several technical and educational journals including Computers & Education, The British Journal of Education Technology, Informing Science Journal, and the Journal of Instructional Multimedia and Hypermedia and has been an active participant and presenter at the Hawaii International Conference on System Sciences, Frontiers in Education, and Informing Science + Information Technology Education conferences."
  },
  {
  "category":"Faculty",
  "userName":"lwei",
  "middleName":"",
  "degree":"Ph.D.",
  "firstName":"Wei",
  "lastName":"Li",
  "title":"Associate Professor",
  "bio":"Dr. Li joined NSU in 2005, after completing his Ph.D. at Mississippi State University. His research focuses on improving the security of computer systems."
  },
  {
  "category":"Faculty",
  "userName":"tejay",
  "middleName":"",
  "degree":"Ph.D.",
  "firstName":"Gurvirender",
  "lastName":"Tejay",
  "title":"Associate Professor",
  "bio":"Dr. Tejay’s research interests include information system security, information technology strategy, and information quality. His research has been presented in various conferences including the International Federation for Information Processing, Hawaii International Conference on System Sciences, and Americas Conference on Information Systems. Dr. Tejay’s academic interests led him to pursue graduate studies in the field of economics (University of Wisconsin, Milwaukee) and computer science (University of Chicago). He completed his doctoral studies with focus in information systems from Virginia Commonwealth University in 2008."
  },
  {
  "category":"Faculty",
  "userName":"levyy",
  "middleName":"",
  "degree":"Ph.D.",
  "firstName":"Yair",
  "lastName":"Levy",
  "title":"Associate Professor",
  "bio":"Dr. Yair Levy is an associate professor and the director of the Center for e-Learning Security Research. Prior to joining the school, Dr. Levy was instructor and director of online learning at the College of Business Administration at Florida International University, where he earned his Ph.D. in 2003. His current research interests include Security and ethical issues with Web-based and e-learning systems, cyber-security skills, value of information systems and e-learning systems. Dr. Levy is the author of Assessing the Value of e-Learning Systems (2006) and over 30 peer-reviewed publications. His research publications appear in the Journal of Organizational and End User Computing (JOEUC), Journal of Cases on Information Technology (JCIT), International Journal of Information Systems in the Service Sector (IJISSS), Journal of Information Systems Education (JISE), Informing Science Journal (ISJ), Campus-Wide Information Systems (CWIS), The Internet and Higher Education (IHE), journal of Computers & Education, the International Journal of Information and Communications Technology Education (IJICTE), Journal of Internet Banking and Commerce (JIBC), as well as in peer-reviewed conference proceedings. Additionally, he published invited book chapters and encyclopedias. His research publications have been cited by over 200 peer-reviewed manuscripts."
  }
  ]
}
